GopalSaraf/Practicals/PSDL/include/proc/pic16lf19185.h
extern volatile LCDDATA38bits_t LCDDATA38bits __at(0x1D3E);
// bitfield macros
#define _LCDDATA38_S18C6_POSN                               0x2
#define _LCDDATA38_S18C6_POSITION                           0x2
#define _LCDDATA38_S18C6_SIZE                               0x1
#define _LCDDATA38_S18C6_LENGTH                             0x1
#define _LCDDATA38_S18C6_MASK                               0x4
#define _LCDDATA38_S19C6_POSN                               0x3
#define _LCDDATA38_S19C6_POSITION                           0x3
#define _LCDDATA38_S19C6_SIZE                               0x1
#define _LCDDATA38_S19C6_LENGTH                             0x1
#define _LCDDATA38_S19C6_MASK                               0x8
#define _LCDDATA38_S20C6_POSN                               0x4
#define _LCDDATA38_S20C6_POSITION                           0x4
#define _LCDDATA38_S20C6_SIZE                               0x1
#define _LCDDATA38_S20C6_LENGTH                             0x1
#define _LCDDATA38_S20C6_MASK                               0x10
#define _LCDDATA38_S22C6_POSN                               0x6
#define _LCDDATA38_S22C6_POSITION                           0x6
#define _LCDDATA38_S22C6_SIZE                               0x1
#define _LCDDATA38_S22C6_LENGTH                             0x1
#define _LCDDATA38_S22C6_MASK                               0x40
#define _LCDDATA38_S23C6_POSN                               0x7
#define _LCDDATA38_S23C6_POSITION                           0x7
#define _LCDDATA38_S23C6_SIZE                               0x1
#define _LCDDATA38_S23C6_LENGTH                             0x1
#define _LCDDATA38_S23C6_MASK                               0x80

// Register: LCDDATA39
#define LCDDATA39 LCDDATA39
extern volatile unsigned char           LCDDATA39           __at(0x1D3F);
#ifndef _LIB_BUILD
asm("LCDDATA39 equ 01D3Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S24C6                  :1;
        unsigned S25C6                  :1;
        unsigned S26C6                  :1;
        unsigned S27C6                  :1;
        unsigned S28C6                  :1;
        unsigned S29C6                  :1;
        unsigned S30C6                  :1;
        unsigned S31C6                  :1;
    };
} LCDDATA39bits_t;
extern volatile LCDDATA39bits_t LCDDATA39bits __at(0x1D3F);
// bitfield macros
#define _LCDDATA39_S24C6_POSN                               0x0
#define _LCDDATA39_S24C6_POSITION                           0x0
#define _LCDDATA39_S24C6_SIZE                               0x1
#define _LCDDATA39_S24C6_LENGTH                             0x1
#define _LCDDATA39_S24C6_MASK                               0x1
#define _LCDDATA39_S25C6_POSN                               0x1
#define _LCDDATA39_S25C6_POSITION                           0x1
#define _LCDDATA39_S25C6_SIZE                               0x1
#define _LCDDATA39_S25C6_LENGTH                             0x1
#define _LCDDATA39_S25C6_MASK                               0x2
#define _LCDDATA39_S26C6_POSN                               0x2
#define _LCDDATA39_S26C6_POSITION                           0x2
#define _LCDDATA39_S26C6_SIZE                               0x1
#define _LCDDATA39_S26C6_LENGTH                             0x1
#define _LCDDATA39_S26C6_MASK                               0x4
#define _LCDDATA39_S27C6_POSN                               0x3
#define _LCDDATA39_S27C6_POSITION                           0x3
#define _LCDDATA39_S27C6_SIZE                               0x1
#define _LCDDATA39_S27C6_LENGTH                             0x1
#define _LCDDATA39_S27C6_MASK                               0x8
#define _LCDDATA39_S28C6_POSN                               0x4
#define _LCDDATA39_S28C6_POSITION                           0x4
#define _LCDDATA39_S28C6_SIZE                               0x1
#define _LCDDATA39_S28C6_LENGTH                             0x1
#define _LCDDATA39_S28C6_MASK                               0x10
#define _LCDDATA39_S29C6_POSN                               0x5
#define _LCDDATA39_S29C6_POSITION                           0x5
#define _LCDDATA39_S29C6_SIZE                               0x1
#define _LCDDATA39_S29C6_LENGTH                             0x1
#define _LCDDATA39_S29C6_MASK                               0x20
#define _LCDDATA39_S30C6_POSN                               0x6
#define _LCDDATA39_S30C6_POSITION                           0x6
#define _LCDDATA39_S30C6_SIZE                               0x1
#define _LCDDATA39_S30C6_LENGTH                             0x1
#define _LCDDATA39_S30C6_MASK                               0x40
#define _LCDDATA39_S31C6_POSN                               0x7
#define _LCDDATA39_S31C6_POSITION                           0x7
#define _LCDDATA39_S31C6_SIZE                               0x1
#define _LCDDATA39_S31C6_LENGTH                             0x1
#define _LCDDATA39_S31C6_MASK                               0x80

// Register: LCDDATA40
#define LCDDATA40 LCDDATA40
extern volatile unsigned char           LCDDATA40           __at(0x1D40);
#ifndef _LIB_BUILD
asm("LCDDATA40 equ 01D40h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S32C6                  :1;
        unsigned S33C6                  :1;
        unsigned S34C6                  :1;
    };
} LCDDATA40bits_t;
extern volatile LCDDATA40bits_t LCDDATA40bits __at(0x1D40);
// bitfield macros
#define _LCDDATA40_S32C6_POSN                               0x0
#define _LCDDATA40_S32C6_POSITION                           0x0
#define _LCDDATA40_S32C6_SIZE                               0x1
#define _LCDDATA40_S32C6_LENGTH                             0x1
#define _LCDDATA40_S32C6_MASK                               0x1
#define _LCDDATA40_S33C6_POSN                               0x1
#define _LCDDATA40_S33C6_POSITION                           0x1
#define _LCDDATA40_S33C6_SIZE                               0x1
#define _LCDDATA40_S33C6_LENGTH                             0x1
#define _LCDDATA40_S33C6_MASK                               0x2
#define _LCDDATA40_S34C6_POSN                               0x2
#define _LCDDATA40_S34C6_POSITION                           0x2
#define _LCDDATA40_S34C6_SIZE                               0x1
#define _LCDDATA40_S34C6_LENGTH                             0x1
#define _LCDDATA40_S34C6_MASK                               0x4

