GopalSaraf/Practicals/PSDL/include/proc/pic16lf19185.h
// Register: RX1PPS
#define RX1PPS RX1PPS
extern volatile unsigned char           RX1PPS              __at(0x1ECB);
#ifndef _LIB_BUILD
asm("RX1PPS equ 01ECBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RX1PPS                 :5;
    };
    struct {
        unsigned RX1PPS0                :1;
        unsigned RX1PPS1                :1;
        unsigned RX1PPS2                :1;
        unsigned RX1PPS3                :1;
        unsigned RX1PPS4                :1;
    };
} RX1PPSbits_t;
extern volatile RX1PPSbits_t RX1PPSbits __at(0x1ECB);
// bitfield macros
#define _RX1PPS_RX1PPS_POSN                                 0x0
#define _RX1PPS_RX1PPS_POSITION                             0x0
#define _RX1PPS_RX1PPS_SIZE                                 0x5
#define _RX1PPS_RX1PPS_LENGTH                               0x5
#define _RX1PPS_RX1PPS_MASK                                 0x1F
#define _RX1PPS_RX1PPS0_POSN                                0x0
#define _RX1PPS_RX1PPS0_POSITION                            0x0
#define _RX1PPS_RX1PPS0_SIZE                                0x1
#define _RX1PPS_RX1PPS0_LENGTH                              0x1
#define _RX1PPS_RX1PPS0_MASK                                0x1
#define _RX1PPS_RX1PPS1_POSN                                0x1
#define _RX1PPS_RX1PPS1_POSITION                            0x1
#define _RX1PPS_RX1PPS1_SIZE                                0x1
#define _RX1PPS_RX1PPS1_LENGTH                              0x1
#define _RX1PPS_RX1PPS1_MASK                                0x2
#define _RX1PPS_RX1PPS2_POSN                                0x2
#define _RX1PPS_RX1PPS2_POSITION                            0x2
#define _RX1PPS_RX1PPS2_SIZE                                0x1
#define _RX1PPS_RX1PPS2_LENGTH                              0x1
#define _RX1PPS_RX1PPS2_MASK                                0x4
#define _RX1PPS_RX1PPS3_POSN                                0x3
#define _RX1PPS_RX1PPS3_POSITION                            0x3
#define _RX1PPS_RX1PPS3_SIZE                                0x1
#define _RX1PPS_RX1PPS3_LENGTH                              0x1
#define _RX1PPS_RX1PPS3_MASK                                0x8
#define _RX1PPS_RX1PPS4_POSN                                0x4
#define _RX1PPS_RX1PPS4_POSITION                            0x4
#define _RX1PPS_RX1PPS4_SIZE                                0x1
#define _RX1PPS_RX1PPS4_LENGTH                              0x1
#define _RX1PPS_RX1PPS4_MASK                                0x10

// Register: TX1PPS
#define TX1PPS TX1PPS
extern volatile unsigned char           TX1PPS              __at(0x1ECC);
#ifndef _LIB_BUILD
asm("TX1PPS equ 01ECCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TX1PPS                 :5;
    };
    struct {
        unsigned TX1PPS0                :1;
        unsigned TX1PPS1                :1;
        unsigned TX1PPS2                :1;
        unsigned TX1PPS3                :1;
        unsigned TX1PPS4                :1;
    };
} TX1PPSbits_t;
extern volatile TX1PPSbits_t TX1PPSbits __at(0x1ECC);
// bitfield macros
#define _TX1PPS_TX1PPS_POSN                                 0x0
#define _TX1PPS_TX1PPS_POSITION                             0x0
#define _TX1PPS_TX1PPS_SIZE                                 0x5
#define _TX1PPS_TX1PPS_LENGTH                               0x5
#define _TX1PPS_TX1PPS_MASK                                 0x1F
#define _TX1PPS_TX1PPS0_POSN                                0x0
#define _TX1PPS_TX1PPS0_POSITION                            0x0
#define _TX1PPS_TX1PPS0_SIZE                                0x1
#define _TX1PPS_TX1PPS0_LENGTH                              0x1
#define _TX1PPS_TX1PPS0_MASK                                0x1
#define _TX1PPS_TX1PPS1_POSN                                0x1
#define _TX1PPS_TX1PPS1_POSITION                            0x1
#define _TX1PPS_TX1PPS1_SIZE                                0x1
#define _TX1PPS_TX1PPS1_LENGTH                              0x1
#define _TX1PPS_TX1PPS1_MASK                                0x2
#define _TX1PPS_TX1PPS2_POSN                                0x2
#define _TX1PPS_TX1PPS2_POSITION                            0x2
#define _TX1PPS_TX1PPS2_SIZE                                0x1
#define _TX1PPS_TX1PPS2_LENGTH                              0x1
#define _TX1PPS_TX1PPS2_MASK                                0x4
#define _TX1PPS_TX1PPS3_POSN                                0x3
#define _TX1PPS_TX1PPS3_POSITION                            0x3
#define _TX1PPS_TX1PPS3_SIZE                                0x1
#define _TX1PPS_TX1PPS3_LENGTH                              0x1
#define _TX1PPS_TX1PPS3_MASK                                0x8
#define _TX1PPS_TX1PPS4_POSN                                0x4
#define _TX1PPS_TX1PPS4_POSITION                            0x4
#define _TX1PPS_TX1PPS4_SIZE                                0x1
#define _TX1PPS_TX1PPS4_LENGTH                              0x1
#define _TX1PPS_TX1PPS4_MASK                                0x10

// Register: RX2PPS
#define RX2PPS RX2PPS
extern volatile unsigned char           RX2PPS              __at(0x1ECD);
#ifndef _LIB_BUILD
asm("RX2PPS equ 01ECDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RX2PPS                 :5;
    };
    struct {
        unsigned RX2PPS0                :1;
        unsigned RX2PPS1                :1;
        unsigned RX3PPS2                :1;
        unsigned RX4PPS3                :1;
        unsigned RX5PPS4                :1;
    };
} RX2PPSbits_t;
extern volatile RX2PPSbits_t RX2PPSbits __at(0x1ECD);
// bitfield macros
#define _RX2PPS_RX2PPS_POSN                                 0x0
#define _RX2PPS_RX2PPS_POSITION                             0x0
#define _RX2PPS_RX2PPS_SIZE                                 0x5
#define _RX2PPS_RX2PPS_LENGTH                               0x5
#define _RX2PPS_RX2PPS_MASK                                 0x1F
#define _RX2PPS_RX2PPS0_POSN                                0x0
#define _RX2PPS_RX2PPS0_POSITION                            0x0
#define _RX2PPS_RX2PPS0_SIZE                                0x1
#define _RX2PPS_RX2PPS0_LENGTH                              0x1
#define _RX2PPS_RX2PPS0_MASK                                0x1
#define _RX2PPS_RX2PPS1_POSN                                0x1
#define _RX2PPS_RX2PPS1_POSITION                            0x1
#define _RX2PPS_RX2PPS1_SIZE                                0x1
#define _RX2PPS_RX2PPS1_LENGTH                              0x1
#define _RX2PPS_RX2PPS1_MASK                                0x2
#define _RX2PPS_RX3PPS2_POSN                                0x2
#define _RX2PPS_RX3PPS2_POSITION                            0x2
#define _RX2PPS_RX3PPS2_SIZE                                0x1
#define _RX2PPS_RX3PPS2_LENGTH                              0x1
#define _RX2PPS_RX3PPS2_MASK                                0x4
#define _RX2PPS_RX4PPS3_POSN                                0x3
#define _RX2PPS_RX4PPS3_POSITION                            0x3
#define _RX2PPS_RX4PPS3_SIZE                                0x1
#define _RX2PPS_RX4PPS3_LENGTH                              0x1
#define _RX2PPS_RX4PPS3_MASK                                0x8
#define _RX2PPS_RX5PPS4_POSN                                0x4
#define _RX2PPS_RX5PPS4_POSITION                            0x4
#define _RX2PPS_RX5PPS4_SIZE                                0x1
#define _RX2PPS_RX5PPS4_LENGTH                              0x1
#define _RX2PPS_RX5PPS4_MASK                                0x10

// Register: TX2PPS
#define TX2PPS TX2PPS
extern volatile unsigned char           TX2PPS              __at(0x1ECE);
#ifndef _LIB_BUILD
asm("TX2PPS equ 01ECEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TX2PPS                 :5;
    };
    struct {
        unsigned TX2PPS0                :1;
        unsigned TX2PPS1                :1;
        unsigned TX2PPS2                :1;
        unsigned TX2PPS3                :1;
        unsigned TX2PPS4                :1;
    };
} TX2PPSbits_t;
